app/controllers/cases_controller.rb

  def index
    @cases = Case.all
---
SELECT * FROM `cases`

  def show
    @case = Case.find(params[:id])
---
SELECT * FROM `cases` WHERE (`cases`.`id` = 1)

  def edit
    @case = Case.find(params[:id])
---
SELECT * FROM `cases` WHERE (`cases`.`id` = 1)

  def create
    @case = Case.new(params[:case])

    respond_to do |format|
      if @case.save
---
INSERT INTO `cases` (`type1`, `updated_at`, `casenumber`, `status`, `case_orgin`, `created_at`) VALUES('Electrical', '2012-08-11 13:33:57', '0007', 'Working', 'Phone', '2012-08-11 13:33:57')

  def update
    @case = Case.find(params[:id])

    respond_to do |format|
      if @case.update_attributes(params[:case])
---
SELECT * FROM `cases` WHERE (`cases`.`id` = 28)
UPDATE `cases` SET `updated_at` = '2012-07-04 09:45:11', `status` = 'Working' WHERE `id` = 28

  def destroy
    @case = Case.find(params[:id])
    @case.destroy
---
SELECT * FROM `cases` WHERE (`cases`.`id` = 4)
DELETE FROM `cases` WHERE `id` = 4